{

    // --створити масив та вивести його в консоль:
    // - з 5 числових значень
    const nums = [1,2,3,4,5];
    console.log(nums);
    // - з 5 стічкових значень
    const strs = ['a','b','c','d','e'];
    console.log(strs);
    // - з 5 значень стрічкового, числового та булевого типу
    const mix = [true,false,'a','b',5];
    console.log(mix);

    consoleLine();
    //------------------------------------------------------------------
    //-- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
    {
        const arr = [];
        arr[0] = 1;
        arr[1] = 'a';
        arr[2] = true;
        console.log(arr);
    }

    consoleLine();
    //------------------------------------------------------------------
    // - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом всередині
    for (let i = 0; i < 10; i++) {
        document.write('<div>Some text...</div>');
    }

    htmlLine();
    //------------------------------------------------------------------
    // - За допомогою циклу for і document.write() вивести 10 блоків div c довільним текстом і індексом всередині
    for (let i = 0; i < 10; i++) {
        document.write(`<div>Some text ${i+1}</div>`);
    }

    htmlLine();
    //------------------------------------------------------------------
    // - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом всередині.
    for (let i = 0; i < 20; i++) {
        document.write(`<h1>Some title...</h1>`);
    }

    htmlLine();
    //------------------------------------------------------------------
    // - За допомогою циклу while вивести в документ 20 блоків h1 c довільним текстом і індексом всередині.
    for (let i = 0; i < 20; i++) {
        document.write(`<h1>Some title ${i+1}</h1>`);
    }

    htmlLine();
    //------------------------------------------------------------------
    // - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
    const nums2 = [1,2,3,4,5,6,7,8,9,10];
    for (const num of nums2) {
        console.log(num);
    }

    consoleLine();
    //------------------------------------------------------------------
    // - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
    const strs2 = ['a','b','c','d','e','f','g','h','i','j'];
    for (const str of strs2) {
        console.log(str);
    }

    consoleLine();
    //------------------------------------------------------------------
    // - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
    const mix2 = [1,2,3,4,'a','b','c','d',true,false];
    for (const elem of mix2) {
        console.log(elem);
    }

    consoleLine();
    //------------------------------------------------------------------
    // - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
    for (const elem of mix2) {
        if (typeof elem === 'boolean') console.log(elem);
    }

    consoleLine();
    //------------------------------------------------------------------
    // - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
    for (const elem of mix2) {
        if (typeof elem === 'number') console.log(elem);
    }

    consoleLine();
    //------------------------------------------------------------------
    // - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
    for (const elem of mix2) {
        if (typeof elem === 'string') console.log(elem);
    }

    consoleLine();
    //------------------------------------------------------------------
    // - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
    const mix3 = [];
    mix3[0] = 1;
    mix3[1] = 2;
    mix3[2] = 3;
    mix3[3] = 4;
    mix3[4] = 'a';
    mix3[5] = 'b';
    mix3[6] = 'c';
    mix3[7] = 'd';
    mix3[8] = true;
    mix3[9] = false;

    for (const elem of mix3) {
        console.log(elem);
    }

    consoleLine();
    //------------------------------------------------------------------
    // - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
    for (let i = 0; i < 10; i++) {
        console.log(i);
        document.write(i);
    }

    consoleLine();
    htmlLine();
    //------------------------------------------------------------------
    // - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
    for (let i = 0; i < 100; i++) {
        console.log(i);
        document.write(i);
    }

    consoleLine();
    htmlLine();
    //------------------------------------------------------------------
    // - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
    for (let i = 0; i < 100; i+=2) {
        console.log(i);
        document.write(i);
    }

    consoleLine();
    htmlLine();
    //------------------------------------------------------------------
    // - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
    for (let i = 0; i < 100; i++) {
        if (!(i % 2)) {
            console.log(i);
            document.write(i);
        }
    }

    consoleLine();
    htmlLine();
    //------------------------------------------------------------------
    // - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
    for (let i = 0; i < 100; i++) {
        if (i % 2) {
            console.log(i);
            document.write(i);
        }
    }

    consoleLine();
    htmlLine();
    //------------------------------------------------------------------
    // - Відтворити роботу годинника, відрахувавши 2 хвилини (2 цикли! 1й - хвилини, 2й - секунди)
    for (let m = 0; m < 2; m++) {
        if (m < 10) m = '0' + m;
        for (let s = 0; s < 60; s++) {
            if (s < 10) s = '0' + s;
            // console.log(`${m}:${s}`); //00:00 - 01:59:
        }
    }

    //consoleLine();
    //------------------------------------------------------------------
    // - Відтворити роботу годинника, відрахувавши  2 години 20 хвилини (3 цикли! 1й - години, 2й - хвилини, 3й - секунди)
    const timeStop = '02:20:00';
    outer:
    for (let h = 0; h < 24; h++) {
    	if (h < 10) h = '0' + h;
     		for (let m = 0; m < 60; m++) {
     			if (m < 10) m = '0' + m;
    		for (let s = 0; s < 60; s++) {
    			if (s < 10) s = '0' + s;
    			let res = `${h}:${m}:${s}`;
    			//console.log(res); // 00:00:00 - 02:20:00
    			if (res === timeStop) break outer;
    		}
    	}
    }

    //consoleLine();
    //------------------------------------------------------------------
    // Додатково
    // - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for зібрати всі букви в слово.
    {
        let arr = ['a','b','c'];
        let str = '';

        for (let i = 0; i < arr.length; i++) {
            str += arr[i];
        }

        // console.log(str); //abc
    }

    //------------------------------------------------------------------
    // - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу while зібрати всі букви в слово.
    {
        let arr = [ 'a','b','c'];
        let counter = 0;
        let str = '';
        while (counter < arr.length) {
            str += arr[counter];
            counter++;
        }

        // console.log(str); //abc
    }
    //------------------------------------------------------------------
    // - Дано масив: [ 'a', 'b', 'c'] . За допомогою циклу for of зібрати всі букви в слово.
    {
        let arr = ['a','b','c'];
        let str = '';

        for (const s of arr) {
            str += s;
        }

        // console.log(str); //abc
    }
    //------------------------------------------------------------------
    // =================
    // =================
    // =================
    // =================
    //
    // - Дан масив ['a', 'b', 'c']. Додайте йому в кінець елементи 1, 2, 3 за допомогою циклу.
    {
        let arr = ['a','b','c'];

        for (let i = 1; i <= 3; i++) {
            arr.push(i);
        }

        // console.log(arr); //['a','b','c',1,2,3]
    }
    //------------------------------------------------------------------
    // - Дан масив [1, 2, 3]. Зробіть з нього новий масив [3, 2, 1].
    let arrReverse = [1,2,3].reverse();
    //console.log(arrReverse); [3, 2, 1]
    //------------------------------------------------------------------
    // - Дан масив [1, 2, 3]. Додайте йому в кінець елементи 4, 5, 6.
    {
        let arr = [1,2,3];
        arr.push(4,5,6);
        // console.log(arr); //[1, 2 ,3, 4, 5, 6]
    }
    //------------------------------------------------------------------
    // - Дан масив [1, 2, 3]. Додайте йому в початок елементи 4, 5, 6.
    {
        let arr = [1,2,3];
        arr.unshift(4,5,6);
        // console.log(arr); //[4, 5, 6, 1, 2, 3]
    }
    //------------------------------------------------------------------
    // - Дан масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
    {
        let strs = ['js', 'css', 'jq'];
        document.write(strs.shift(0));
    }

    htmlLine();
    //------------------------------------------------------------------
    // - Дан масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
    {
        let strs = ['js', 'css', 'jq'];
        document.write(strs.pop(strs.length-1));
    }

    htmlLine();
    //------------------------------------------------------------------
    // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [4, 5].
    {
        let nums = [1, 2, 3, 4, 5];
        nums = nums.slice(3);
        //console.log(nums); // [4, 5]
    }

    //------------------------------------------------------------------
    // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції slice перетворіть масив в [1,2].
    {
        let nums = [1, 2, 3, 4, 5];
        nums = nums.slice(0,2);
        // console.log(nums); // [1, 2]
    }

    //------------------------------------------------------------------
    // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice перетворіть масив в [1, 4, 5].
    {
        let nums = [1, 2, 3, 4, 5];
        nums.splice(1,2);
        // console.log(nums); // [1, 4, 5]
    }

    //------------------------------------------------------------------
    // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
    {
        let nums = [1, 2, 3, 4, 5];
        nums.splice(3,0,'a','b','c');
        // console.log(nums); // [1, 2, 3, 'a', 'b', 'c', 4, 5]
    }
    // - Дан масив [1, 2, 3, 4, 5]. За допомогою методу/функції splice зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
    {
        let nums = [1, 2, 3, 4, 5];
        nums.splice(1,0,'a','b');
        nums.splice(6,0,'c');
        nums.splice(8,0,'e');
        // console.log(nums); // [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e']
    }
    //------------------------------------------------------------------
    // - Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
    {
        let nums = [1,2,3,4,5,6,7,8,9,10];

        for (const num of nums) {
            if (!(num % 2)) console.log(num); //2,4,6,8,10
        }
    }

    consoleLine();
    //------------------------------------------------------------------
    // - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
    {
        let nums = [1,2,3,4,5,6,7,8,9,10];
        let arr = [];

        for (const num of nums) {
            arr.push(num);
        }

        //console.log(arr); //[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    }

    //consoleLine();
    //------------------------------------------------------------------
    // - Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
    {
        let nums = [1,2,3,4,5,6,7,8,9,10];
        let arr = [];

        for (let i = 0; i < nums.length; i++) {
            arr[i] = nums[i];
        }

        //console.log(arr); //[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
    }

    consoleLine();
    //------------------------------------------------------------------

    // !!!!!!!!!!!!!!!!!!УЖЕ ДЕЛАЛ В ПРОШЛОМ ЗАДАНИИ!!!!!!!!!!!!!!!!!!!!COPY/PASTE
    //
    // зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
    let arr = [2,17,13,6,22,31,45,66,100,-18];
    // 1. перебрати його циклом while
    {
        let i = 0;
        while (i < arr.length) {
            console.log(arr[i]); //2,17,13,6,22,31,45,66,100,-18
            i++;
        }
    }
    //------------------------------------------------------------------
    // 2. перебрати його циклом for
    for (let i = 0; i < arr.length; i++) {
        console.log(arr[i]); //2,17,13,6,22,31,45,66,100,-18
    }
    //------------------------------------------------------------------
    // 3. перебрати циклом while та вивести  числа тільки з непарним індексом
    {
        let i = 0;
        while (i < arr.length) {
            if (!(i % 2)) console.log(arr[i]); //2,13,22,45,100
            i++;
        }
    }
    //------------------------------------------------------------------
    // 4. перебрати циклом for та вивести  числа тільки з непарним індексом
    for (let i = 0; i < arr.length; i++) {
        if (!(i % 2)) console.log(arr[i]); //2,13,22,45,100
    }
    //------------------------------------------------------------------
    // 5. перебрати циклом while та вивести  числа тільки парні  значення
    {
        let i = 0;
        while (i < arr.length) {
            if (!(arr[i] % 2)) console.log(arr[i]); //2,6,22,66,100,-18
            i++;
        }
    }
    //------------------------------------------------------------------
    // 6. перебрати циклом for та вивести  числа тільки парні  значення
    for (let i = 0; i < arr.length; i++) {
        if (!(arr[i] % 2)) console.log(arr[i]); //2,6,22,66,100,-18
    }
    //------------------------------------------------------------------
    // 7. замінити кожне число кратне 3 на слово "okten"
    for (let i = 0; i < arr.length; i++) {
        if (!(arr[i] % 3)) arr[i] = 'okten';
    }
    console.log(arr);//[2, 17, 13, "okten", 22, 31, "okten", "okten", 100, "okten"]
    //------------------------------------------------------------------
    // 8. вивести масив в зворотньому порядку.
    arr.reverse().forEach(n => console.log(n)); //"okten",100,"okten","okten",31,22,"okten",13,17,2
    //------------------------------------------------------------------
    // 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
    arr = [2,17,13,6,22,31,45,66,100,-18];
    //#1------------------------------
    {
        let i = arr.length;
        while (i--) {
            console.log(arr[i]); //-18,100,66,45,31,22,6,13,17,2
        }
    }
    consoleLine();
    //#2------------------------------
    for (let i = arr.length; i--;) {
        console.log(arr[i]); //-18,100,66,45,31,22,6,13,17,2
    }
    consoleLine();
    //#3------------------------------
    {
        let i = arr.length;
        while (i--) {
            if (!(i % 2)) console.log(arr[i]); //100,45,22,13,2
        }
    }
    consoleLine();
    //#4------------------------------
    for (let i = arr.length; i--;) {
        if (!(i % 2)) console.log(arr[i]); //100,45,22,13,2
    }
    consoleLine();
    //#5------------------------------
    {
        let i = arr.length;
        while (i--) {
            if (!(arr[i] % 2)) console.log(arr[i]); //-18,100,66,22,6,2
        }
    }
    consoleLine();
    //#6-----------------------------
    for (let i = arr.length; i--;) {
        if (!(arr[i] % 2)) console.log(arr[i]); //-18,100,66,22,6,2
    }
    consoleLine();
    //#7-----------------------------
    for (let i = arr.length; i--;) {
        if (!(arr[i] % 3)) arr[i] = 'okten';
    }
    console.log(arr);//[2, 17, 13, "okten", 22, 31, "okten", "okten", 100, "okten"]
    // 10
    // створити пустий масив та :
    // - заповнити його 50 парними числами за допомоги циклу.
    {
        let arr = [];
        let count = 2;

        for (let i = 0; i < 50; i++) {
            arr[i] = count;
            count += 2;
        }
        // console.log(arr); //[2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76, 78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98, 100]
    }
    //------------------------------------------------------------------
    // - заповнити його 50 непарними числами за допомоги циклу.
    {
        let arr = [];
        let count = 1;

        for (let i = 0; i < 50; i++) {
            arr[i] = count;
            count += 2;
        }
        //console.log(arr); //[1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25, 27, 29, 31, 33, 35, 37, 39, 41, 43, 45, 47, 49, 51, 53, 55, 57, 59, 61, 63, 65, 67, 69, 71, 73, 75, 77, 79, 81, 83, 85, 87, 89, 91, 93, 95, 97, 99]
    }
    //------------------------------------------------------------------
    // 3. используя Math.random заполнить массив из ???(сколько хотите) элементов.
    // диапазон рандома 8 до 732. (но сначала пробуйте БЕЗ ДИАПАЗОНА!)

    let arr1 = [];
    function randomInteger(min, max) {
        return Math.floor(min + Math.random() * (max + 1) - min);
    }

    for (let i = 0; i < 20; i++) {
        arr1.push(randomInteger(8, 732));
    }
    // console.log(arr1);
    //------------------------------------------------------------------
    // 2. вывести на консоль  каждый третий елемент
    for (let i = 0; i < arr1.length; i+=3) {
        console.log(arr1[i]);
    }

    consoleLine();
    //------------------------------------------------------------------
    // 3. вывести на консоль  каждый третий елемент
    // но при условии что его значение является парным.
    for (let i = 0; i < arr1.length; i+=3) {
        if (!(arr1[i] % 2)) console.log(arr1[i]);
    }

    consoleLine();
    //------------------------------------------------------------------
    // 4. вывести на консоль  каждый третий елемент
    // но при условии что он имеет парное значение и
    // записать их в другой массив.
    let arr2 = [];
    for (let i = 0; i < arr1.length; i+=3) {
        if (!(arr1[i] % 2)) arr2.push(arr1[i]);
    }
    console.log(arr2);
    //------------------------------------------------------------------
    // 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
    console.log(arr1);
    for (let i = 0; i < arr1.length; i++) {
        if (!(arr1[i]%2) && arr1[i+1]) console.log(arr1[i+1]);
    }
    consoleLine();
    //------------------------------------------------------------------
    // 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
    {
        let arr = [100,250,50,168,120,345,188];
        console.log(arr.reduce((sum,n) => sum += n)/arr.length);
    }
    consoleLine();
    //------------------------------------------------------------------
    // 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
    {
        let arr = [...Array(10)].map(n => n = Math.random() * 5);
        console.log(arr);
    }
    consoleLine();
    //------------------------------------------------------------------
    // 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
    // додати його в інший масив.
    {
        let nums = [1,'string', true, false, null, 2, undefined, 3].filter(x => typeof x === 'number');
        console.log(nums); //[1,2,3]
    }

    consoleLine();
    //==================================================================
    //==================================================================

    function consoleLine() {
        console.log('-------------------------------------------------');
    }

    function htmlLine() {
        document.write('<hr>');
    }
}